
trained on 3000 sf 10 games, draws included, board -> WDL eval float.
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
Input (InputLayer)              [(64, 10, 8, 8)]     0
__________________________________________________________________________________________________
FrontConv (Conv2D)              (64, 10, 8, 64)      576         Input[0][0]
__________________________________________________________________________________________________
ResConv1 (Conv2D)               (64, 10, 8, 64)      4160        FrontConv[0][0]
__________________________________________________________________________________________________
ResNorm1 (BatchNormalization)   (64, 10, 8, 64)      128         ResConv1[0][0]
__________________________________________________________________________________________________
FrontNorm (BatchNormalization)  (64, 10, 8, 64)      128         FrontConv[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (64, 10, 8, 128)     0           FrontNorm[0][0]
                                                                 ResNorm1[0][0]
__________________________________________________________________________________________________
ResConv2 (Conv2D)               (64, 10, 8, 64)      8256        concatenate[0][0]
__________________________________________________________________________________________________
ResNorm2 (BatchNormalization)   (64, 10, 8, 64)      128         ResConv2[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (64, 10, 8, 128)     0           ResNorm1[0][0]
                                                                 ResNorm2[0][0]
__________________________________________________________________________________________________
ResConv3 (Conv2D)               (64, 10, 8, 64)      8256        concatenate_1[0][0]
__________________________________________________________________________________________________
ResNorm3 (BatchNormalization)   (64, 10, 8, 64)      128         ResConv3[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (64, 10, 8, 128)     0           ResNorm2[0][0]
                                                                 ResNorm3[0][0]
__________________________________________________________________________________________________
ResConv4 (Conv2D)               (64, 10, 8, 64)      8256        concatenate_2[0][0]
__________________________________________________________________________________________________
ResNorm4 (BatchNormalization)   (64, 10, 8, 64)      128         ResConv4[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (64, 10, 8, 128)     0           ResNorm3[0][0]
                                                                 ResNorm4[0][0]
__________________________________________________________________________________________________
ResConv5 (Conv2D)               (64, 10, 8, 64)      8256        concatenate_3[0][0]
__________________________________________________________________________________________________
ResNorm5 (BatchNormalization)   (64, 10, 8, 64)      128         ResConv5[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (64, 10, 8, 128)     0           ResNorm4[0][0]
                                                                 ResNorm5[0][0]
__________________________________________________________________________________________________
ResConv6 (Conv2D)               (64, 10, 8, 64)      8256        concatenate_4[0][0]
__________________________________________________________________________________________________
ResNorm6 (BatchNormalization)   (64, 10, 8, 64)      128         ResConv6[0][0]
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (64, 10, 8, 128)     0           ResNorm5[0][0]
                                                                 ResNorm6[0][0]
__________________________________________________________________________________________________
ResConv7 (Conv2D)               (64, 10, 8, 64)      8256        concatenate_5[0][0]
__________________________________________________________________________________________________
ResNorm7 (BatchNormalization)   (64, 10, 8, 64)      128         ResConv7[0][0]
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (64, 10, 8, 128)     0           ResNorm6[0][0]
                                                                 ResNorm7[0][0]
__________________________________________________________________________________________________
ResConv8 (Conv2D)               (64, 10, 8, 64)      8256        concatenate_6[0][0]
__________________________________________________________________________________________________
ResNorm8 (BatchNormalization)   (64, 10, 8, 64)      128         ResConv8[0][0]
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (64, 10, 8, 128)     0           ResNorm7[0][0]
                                                                 ResNorm8[0][0]
__________________________________________________________________________________________________
ResConv9 (Conv2D)               (64, 10, 8, 64)      8256        concatenate_7[0][0]
__________________________________________________________________________________________________
ResNorm9 (BatchNormalization)   (64, 10, 8, 64)      128         ResConv9[0][0]
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (64, 10, 8, 128)     0           ResNorm8[0][0]
                                                                 ResNorm9[0][0]
__________________________________________________________________________________________________
ResConv10 (Conv2D)              (64, 10, 8, 64)      8256        concatenate_8[0][0]
__________________________________________________________________________________________________
ResNorm10 (BatchNormalization)  (64, 10, 8, 64)      128         ResConv10[0][0]
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (64, 10, 8, 128)     0           ResNorm9[0][0]
                                                                 ResNorm10[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (64, 10240)          0           concatenate_9[0][0]
__________________________________________________________________________________________________
Dense1 (Dense)                  (64, 512)            5243392     flatten[0][0]
__________________________________________________________________________________________________
eval (Dense)                    (64, 1)              513         Dense1[0][0]
==================================================================================================
Total params: 5,324,353
Trainable params: 5,322,945
Non-trainable params: 1,408
__________________________________________________________________________________________________